# PerformanceAdviserRuleId Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
PerformanceAdviserRuleId Constructor
PerformanceAdviserRuleId Class See Also
---
Creates a new PerformanceAdviserRuleId instance.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public PerformanceAdviserRuleId(
	Guid guid
)
```

Visual Basic
---
```text
Public Sub New ( _
	guid As Guid _
)
```

Visual C++
---
```text
public:
PerformanceAdviserRuleId(
	Guid guid
)
```

# ### Parameters
guid
    Type: System..::..GuidThe identifier for the PerformanceAdviserRuleId.
# See Also
PerformanceAdviserRuleId Class
Autodesk.Revit.DB Namespace